<a href="https://colab.research.google.com/github/Luiz-Souza/Python-Colab/blob/master/Copy_of_Pereirapy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Operação pereira

In [0]:
## Atribuição variável
x = 1
print(x)

1

In [0]:
## To float
print( float(x) )

1.0

In [0]:
## to int
print( int(1) )

1

In [0]:
## concat char
print( str(1) + '222' )

1222

In [0]:
## boolean
print( bool(1) )

print( bool(0) )

print( int(True) )

print( int(False))

True
False
1
0

In [0]:
## if com saida tipo bool

if 1 > 2:
  print(True)
else:
  print(False)

False

In [0]:
## for loop
for i in range(4):
  print(i)

0
1
2
3

In [0]:
## for + lista
list = [1, 2, 3, 4, 5]

for i in list:
  print(i)

1
2
3
4
5

In [0]:
## for in line
print( [i+1 for i in list] )

[2, 3, 4, 5, 6]

## Listas

In [0]:
## lista (dica pessoal usa _ antes dos nomes para não utilizar nomes reservados)
_list = ['a', 'b', 'c', 'd', 'f', 'g', 'h']
print(_list)

['a', 'b', 'c', 'd', 'f', 'g', 'h']

In [0]:
len(_list)

7

In [0]:
print(_list[0])
print(_list[1:3])
print(_list[-1])
print(_list[3:-1])
print(_list[:-1])

a
['b', 'c']
h
['d', 'f', 'g']
['a', 'b', 'c', 'd', 'f', 'g']

In [0]:
_item = _list.pop()
print(_item)

h

https://www.w3schools.com/python/python_lists.asp

# Funções

In [0]:
def soma1(x):
  return x + 1

print(soma1(4))

5

In [0]:
## paraemtro default se vazio
def soma1(x = 5):
  return x + 1

print(soma1())

6

In [0]:
## Estudar numpy, utilizado para listas e calculos

# Pandas Data frames

In [0]:
# Import pandas library 
import pandas as pd 
  
# initialize list of lists 
data = [['tom', 10], ['nick', 15], ['juli', 14]] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['Name', 'Age']) 
  
# print dataframe. 
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [0]:
print(df)

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [0]:
# intialise data of lists. 
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]} 
  
# Create DataFrame 
df = pd.DataFrame(data) 
  
# Print the output. 
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [0]:
import pandas as pd 
  
# Initialise data to lists. 
data = [{'a': 1, 'b': 2, 'c':3}, {'a':10, 'b': 20, 'c': 30}] 
  
# Creates DataFrame. 
df = pd.DataFrame(data) 
  
# Print the data 
df

    a   b   c
0   1   2   3
1  10  20  30

In [0]:
print(df.shape)

(2, 3)

In [0]:
print(df.describe())

               a          b          c
count   2.000000   2.000000   2.000000
mean    5.500000  11.000000  16.500000
std     6.363961  12.727922  19.091883
min     1.000000   2.000000   3.000000
25%     3.250000   6.500000   9.750000
50%     5.500000  11.000000  16.500000
75%     7.750000  15.500000  23.250000
max    10.000000  20.000000  30.000000

In [0]:
print(df.dtypes)

a    int64
b    int64
c    int64
dtype: object

In [0]:
import os

## listando sample data do collab
print( os.listdir('/content/sample_data') )

['README.md', 'anscombe.json', 'california_housing_test.csv', 'mnist_train_small.csv', 'mnist_test.csv', 'california_housing_train.csv']

In [0]:
## csv to data frame
df = pd.read_csv('/content/sample_data/california_housing_test.csv')

df.head(5)

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [0]:
df.shape

(3000, 9)

In [0]:
df.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

In [0]:
df['longitude']

0      -122.05
1      -118.30
2      -117.81
3      -118.36
4      -119.67
         ...
2995   -119.86
2996   -118.14
2997   -119.70
2998   -117.12
2999   -119.63
Name: longitude, Length: 3000, dtype: float64

In [0]:
df['median_house_value'].count()

3000

In [0]:
df['median_house_value'].sum()

617538825.0

In [0]:
df['median_house_value'].mean()

205846.275

In [0]:
df.head(2)

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0

[2 rows x 9 columns]

In [0]:
df.iloc[0]

longitude               -122.0500
latitude                  37.3700
housing_median_age        27.0000
total_rooms             3885.0000
total_bedrooms           661.0000
population              1537.0000
households               606.0000
median_income              6.6085
median_house_value    344700.0000
Name: 0, dtype: float64

In [0]:
df.iloc[0:2]

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0

[2 rows x 9 columns]

In [0]:
df.iloc[0:10]

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0
5    -119.56     36.51  ...         1.6635             67000.0
6    -121.43     38.63  ...         1.6641             67000.0
7    -120.65     35.48  ...         3.2250            166900.0
8    -122.84     38.40  ...         3.6696            194400.0
9    -118.02     34.08  ...         2.3333            164200.0

[10 rows x 9 columns]

In [0]:
df.iloc[0:5, 0:5]

   longitude  latitude  housing_median_age  total_rooms  total_bedrooms
0    -122.05     37.37                27.0       3885.0           661.0
1    -118.30     34.26                43.0       1510.0           310.0
2    -117.81     33.78                27.0       3589.0           507.0
3    -118.36     33.82                28.0         67.0            15.0
4    -119.67     36.33                19.0       1241.0           244.0

In [0]:
df['new'] = df.total_bedrooms*2

df

      longitude  latitude  ...  median_house_value     new
0       -122.05     37.37  ...            344700.0  1322.0
1       -118.30     34.26  ...            176500.0   620.0
2       -117.81     33.78  ...            270500.0  1014.0
3       -118.36     33.82  ...            330000.0    30.0
4       -119.67     36.33  ...             81700.0   488.0
...         ...       ...  ...                 ...     ...
2995    -119.86     34.42  ...            225000.0  1284.0
2996    -118.14     34.06  ...            237200.0  2164.0
2997    -119.70     36.30  ...             62000.0   402.0
2998    -117.12     34.10  ...            162500.0    28.0
2999    -119.63     34.42  ...            500001.0   526.0

[3000 rows x 10 columns]